In [1]:
import pandas as pd 
import numpy as np

# Intro to dataframes

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["a","b","c"])
df.head()
df.tail(2)

   a  b  c
1  4  5  6
2  7  8  9

In [3]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [4]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

In [6]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [7]:
df.nunique() # to find number of unique value in each

a    3
b    3
c    3
dtype: int64

In [8]:
df["a"].unique()# to find unique value in a specific column

array([1, 4, 7])

In [9]:
df.shape

(3, 3)

In [10]:
df.size

9

# loading data from a file

In [11]:
coffee = pd.read_csv("./warmup-data/coffee.csv")
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [12]:
results = pd.read_parquet("./warmup-data/results.parquet")

results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [13]:
results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  object
 2   discipline  308407 non-null  object
 3   event       308408 non-null  object
 4   as          308408 non-null  object
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  object
 7   team        121714 non-null  object
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   object
dtypes: bool(1), float64(2), int64(1), object(7)
memory usage: 23.8+ MB

In [14]:
bios = pd.read_csv("./warmup-data/bios.csv")
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

# accessing data with pandas

### loc[], iloc[]

In [15]:
coffee.sample(5)

          Day Coffee Type  Units Sold
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
5   Wednesday       Latte          25
1      Monday       Latte          15

In [16]:
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [17]:
coffee.loc[[0,4,6]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
4  Wednesday    Espresso          35
6   Thursday    Espresso          40

In [18]:
coffee.loc[5:12]

          Day Coffee Type  Units Sold
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45

In [19]:
coffee.loc[5:12, ["Day", "Units Sold"]]

          Day  Units Sold
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45

In [20]:
coffee.iloc[0:5,[0,2]]
# iloc stand for index_location loc for location

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [21]:
coffee.index = coffee["Day"]

In [22]:

# coffee.loc["Monday","Units Sold"]
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [23]:
# changing perticular value
coffee.loc[1,"Units Sold"]=10
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso        25.0
Monday        Monday       Latte        15.0
Tuesday      Tuesday    Espresso        30.0
Tuesday      Tuesday       Latte        20.0
Wednesday  Wednesday    Espresso        35.0

In [24]:
# wont ot get a specific item only one item then we can use at and iat
# coffee.at[0,"Day"]
# coffee.iat[0,0]

In [25]:
coffee["Units Sold"]

Day
Monday       25.0
Monday       15.0
Tuesday      30.0
Tuesday      20.0
Wednesday    35.0
Wednesday    25.0
Thursday     40.0
Thursday     30.0
Friday       45.0
Friday       35.0
Saturday     45.0
Saturday     35.0
Sunday       45.0
Sunday       35.0
1            10.0
Name: Units Sold, dtype: float64

In [26]:
# coffee.sort_values("Units Sold")
# coffee.sort_values("Units Sold", ascending=False)
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[False,True])

                 Day Coffee Type  Units Sold
Day
Friday        Friday    Espresso        45.0
Saturday    Saturday    Espresso        45.0
Sunday        Sunday    Espresso        45.0
Thursday    Thursday    Espresso        40.0
Wednesday  Wednesday    Espresso        35.0
Friday        Friday       Latte        35.0
Saturday    Saturday       Latte        35.0
Sunday        Sunday       Latte        35.0
Tuesday      Tuesday    Espresso        30.0
Thursday    Thursday       Latte        30.0
Monday        Monday    Espresso        25.0
Wednesday  Wednesday       Latte        25.0
Tuesday      Tuesday       Latte        20.0
Monday        Monday       Latte        15.0
1                NaN         NaN        10.0

In [27]:
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print()

Monday
Day              Monday
Coffee Type    Espresso
Units Sold         25.0
Name: Monday, dtype: object

Monday
Day            Monday
Coffee Type     Latte
Units Sold       15.0
Name: Monday, dtype: object

Tuesday
Day             Tuesday
Coffee Type    Espresso
Units Sold         30.0
Name: Tuesday, dtype: object

Tuesday
Day            Tuesday
Coffee Type      Latte
Units Sold        20.0
Name: Tuesday, dtype: object

Wednesday
Day            Wednesday
Coffee Type     Espresso
Units Sold          35.0
Name: Wednesday, dtype: object

Wednesday
Day            Wednesday
Coffee Type        Latte
Units Sold          25.0
Name: Wednesday, dtype: object

Thursday
Day            Thursday
Coffee Type    Espresso
Units Sold         40.0
Name: Thursday, dtype: object

Thursday
Day            Thursday
Coffee Type       Latte
Units Sold         30.0
Name: Thursday, dtype: object

Friday
Day              Friday
Coffee Type    Espresso
Units Sold         45.0
Name: Friday, dtype: object

Friday
Day            Friday
Coffee Type     Latte
Units Sold       35.0
Name: Friday, dtype: object

Saturday
Day            Saturday
Coffee Type    Espresso
Units Sold         45.0
Name: Saturday, dtype: object

Saturday
Day            Saturday
Coffee Type       Latte
Units Sold         35.0
Name: Saturday, dtype: object

Sunday
Day              Sunday
Coffee Type    Espresso
Units Sold         45.0
Name: Sunday, dtype: object

Sunday
Day            Sunday
Coffee Type     Latte
Units Sold       35.0
Name: Sunday, dtype: object

1
Day             NaN
Coffee Type     NaN
Units Sold     10.0
Name: 1, dtype: object

### filtering data

In [28]:
bios.sample(5)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
72499,73051,Thipsamay Chanthaphone,1961-07-24,NaN,NaN,NaN,Lao People's Democratic Republic,168.0,56.0,NaN
31326,31562,Keld Nielsen,1957-12-12,København (Copenhagen),Hovedstaden,DEN,Denmark,175.0,76.0,NaN
21576,21727,Laurent Bel,1966-01-25,Neuilly-sur-Seine,Hauts-de-Seine,FRA,France,182.0,76.0,NaN
122497,124595,Leandrinho,1982-11-28,São Paulo,São Paulo,BRA,Brazil,194.0,97.0,NaN
27451,27653,Antonio Cámpolo,1897-02-07,Montevideo,Montevideo,URU,Uruguay,NaN,NaN,1959-05-22

In [29]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [37]:
# bios.loc[bios["height_cm"]>220,["name","height_cm"]]

# other way to do it 
bios[bios["height_cm"]>220][["name","height_cm"]]

# adding multiple condition

bios[(bios["height_cm"]>210) & (bios["born_country"]=="USA")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5681,5704,Walt Bellamy,1937-07-24,New Bern,North Carolina,USA,United States,211.0,98.0,2013-11-02
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5894,5919,Mel Counts,1941-10-16,Coos Bay,Oregon,USA,United States,213.0,102.0,NaN
6106,6133,Marc Freiberger,1928-11-27,Amarillo,Texas,USA,United States,211.0,98.0,2005-06-29
6281,6309,Darrall Imhoff,1938-10-11,San Gabriel,California,USA,United States,211.0,98.0,2017-06-30
6379,6410,Joe Kleine,1962-01-04,Colorado Springs,Colorado,USA,United States,211.0,122.0,NaN
6393,6424,Jon Koncak,1963-05-17,Cedar Rapids,Iowa,USA,United States,213.0,113.0,NaN
6442,6473,Christian Laettner,1969-08-17,Angola,New York,USA,United States,211.0,107.0,NaN
6615,6648,Tom McMillen,1952-05-26,Mansfield,Pennsylvania,USA,United States,212.0,95.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
7012,7048,Daniel Santiago,1976-06-24,Tarpon Springs,Florida,USA,Puerto Rico,213.0,111.0,NaN
112319,113575,Chris Kaman,1982-04-28,Wyoming,Michigan,USA,Germany,213.0,122.0,NaN
112366,113622,Dwight Howard,1985-12-08,Atlanta,Georgia,USA,United States,211.0,120.0,NaN
118573,120309,Al-Farouq Aminu,1990-09-21,Atlanta,Georgia,USA,Nigeria,211.0,98.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
132188,135037,Domantas Sabonis,1996-05-03,Portland,Oregon,USA,Lithuania,211.0,109.0,NaN
133332,136271,DeAndre Jordan,1988-07-21,Houston,Texas,USA,United States,211.0,120.0,NaN
142044,145640,Jahlil Okafor,1995-12-15,Fort Smith,Arkansas,USA,Nigeria,211.0,NaN,NaN
142930,146560,Mike Tobey,1994-10-10,Monroe,New York,USA,Slovenia,213.0,NaN,NaN
143712,147367,JaVale McGee,1988-01-19,Flint,Michigan,USA,United States,213.0,NaN,NaN